In [1379]:
# Add Matplotlib inline magic command
#%matplotlib inline
# Dependencies and Setup
#import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [1380]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [1381]:
city_data_df= pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [1382]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [1383]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [1384]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [1385]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [1386]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [1387]:
pyber_data_complete_df =pd.merge(ride_data_df,city_data_df, how="left", on=["city","city"])
pyber_data_complete_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [1388]:
pyber_data_complete_df = pyber_data_complete_df.rename(columns={'city':'City', 'date':'Date', 'fare':'Fare', 'ride_id':'Ride Id', 'driver_count':'No. Drivers', 'type':'City Type'})

In [1389]:
pyber_data_complete_df

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [1390]:
city_count = pyber_data_complete_df.count()
city_count

City           2375
Date           2375
Fare           2375
Ride Id        2375
No. Drivers    2375
City Type      2375
dtype: int64

In [1391]:
pyber_data_complete_df.columns

Index(['City', 'Date', 'Fare', 'Ride Id', 'No. Drivers', 'City Type'], dtype='object')

In [1392]:
type_count = pyber_data_df["type"].unique()
type_count

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [1393]:
type_count_2 = pyber_data_df["type"].count()
type_count_2

2375

In [1394]:
total_fare = ride_data_df["fare"].sum()
total_fare

63538.64

In [1395]:
average_fare_per_ride = ride_data_df["fare"].mean()
average_fare_per_ride

26.753111578947426

In [1396]:
total_rides = pyber_data_df["type"].count()
total_rides

2375

In [1397]:
total_drivers = city_data_df["driver_count"].sum()
total_drivers

2973

In [1398]:
#average_fare_per_driver = city_data_df[]

In [1399]:
# Adding a list of values with keys to create a new DataFrame.
pyber_summary_df = pd.DataFrame(
        [{"Total Rides": total_rides,
        "Total Drivers": total_drivers,
        "Total Fares": total_fare,
        "Average Fare per Ride": average_fare_per_ride}])
#"Average Fare per Driver": average_fare_per_driver}])
pyber_summary_df

   Total Rides  Total Drivers  Total Fares  Average Fare per Ride
0         2375           2973     63538.64              26.753112

In [1400]:
per_city_type = pyber_data_complete_df.set_index(["City Type"])["Fare"]
per_city_type

City Type
Urban    13.83
Urban    30.24
Urban    33.44
Urban    23.44
Urban    34.58
         ...
Rural    13.38
Rural    20.76
Rural    11.11
Rural    44.94
Rural    55.84
Name: Fare, Length: 2375, dtype: float64

In [1401]:
df = pd.DataFrame(per_city_type)
df

            Fare
City Type
Urban      13.83
Urban      30.24
Urban      33.44
Urban      23.44
Urban      34.58
...          ...
Rural      13.38
Rural      20.76
Rural      11.11
Rural      44.94
Rural      55.84

[2375 rows x 1 columns]

In [1402]:
per_type_fare = pyber_data_complete_df.set_index(["City Type"])["Fare"]
per_type_fare

City Type
Urban    13.83
Urban    30.24
Urban    33.44
Urban    23.44
Urban    34.58
         ...
Rural    13.38
Rural    20.76
Rural    11.11
Rural    44.94
Rural    55.84
Name: Fare, Length: 2375, dtype: float64

In [1403]:
per_type_driver = pyber_data_complete_df.set_index(["City Type"])["No. Drivers"]
per_type_driver

City Type
Urban     5
Urban    72
Urban    57
Urban    34
Urban    46
         ..
Rural     6
Rural     2
Rural     1
Rural     4
Rural     1
Name: No. Drivers, Length: 2375, dtype: int64

In [1404]:
per_driver =pyber_data_complete_df.set_index(["No. Drivers"])["Fare"]
per_driver

No. Drivers
5     13.83
72    30.24
57    33.44
34    23.44
46    34.58
      ...
6     13.38
2     20.76
1     11.11
4     44.94
1     55.84
Name: Fare, Length: 2375, dtype: float64

In [1405]:
per_type_ride = pyber_data_complete_df.set_index(["City Type"])["Ride Id"]
per_type_ride

City Type
Urban    5739410935873
Urban    2343912425577
Urban    2005065760003
Urban    5149245426178
Urban    3908451377344
             ...
Rural    8550365057598
Rural    9018727594352
Rural    2781339863778
Rural    4256853490277
Rural    9990581345298
Name: Ride Id, Length: 2375, dtype: int64

In [1406]:
per_type_average = pyber_data_complete_df.groupby(["City Type"]).mean()["Fare"]
per_type_average

City Type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: Fare, dtype: float64

In [1407]:
per_type_total_rides = pyber_data_complete_df.groupby(["City Type"]).count()["City"]
per_type_total_rides

City Type
Rural        125
Suburban     625
Urban       1625
Name: City, dtype: int64

In [1408]:
per_type_total_drivers = city_data_df.groupby(["type"]).sum()["driver_count"]
per_type_total_drivers

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [1409]:
per_type_total_fares = pyber_data_complete_df.groupby(["City Type"]).sum()["Fare"]

per_type_total_fares

City Type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: Fare, dtype: float64

In [1410]:
avg_fare_per_driver = per_type_total_fares/per_type_total_drivers

In [1411]:
# Calculate averages for the desired columns.
#per_type_total_rides = pyber_data_complete_df.groupby(["type"]).count()["Total Rides"]

#per_type_total_drivers = pyber_data_complete_df.groupby(["type"]).sum()["Total Drivers"]

#per_type_total_fares = pyber_data_complete_df.groupby(["type"]).mean()["Total Fares"]

#per_type_average = pyber_data_complete_df.groupby(["type"]).mean()["Average Fare per Ride"]

#per_type_average_driver = pyber_data_complete_df.groupby(["type"]).count()["Average Fare per Driver"]

In [1412]:
# Adding a list of values with keys to create a new DataFrame.
pyber_type_summary_df = pd.DataFrame({
        "Total Rides": per_type_total_rides,
        "Total Drivers": per_type_total_drivers,
        "Total Fares": per_type_total_fares,
        "Average Fare per Ride": per_type_average,
        "Average Fare per Driver": avg_fare_per_driver})

pyber_type_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [1413]:
# Formatting
pyber_type_summary_df["Total Rides"] = pyber_type_summary_df["Total Rides"].map("{:.0f}".format)

pyber_type_summary_df["Total Drivers"] = pyber_type_summary_df["Total Drivers"].map("{:.0f}".format)

pyber_type_summary_df["Total Fares"] = pyber_type_summary_df["Total Fares"].map("${:,.2f}".format)

pyber_type_summary_df["Average Fare per Ride"] = pyber_type_summary_df["Average Fare per Ride"].map("${:,.2f}".format)

pyber_type_summary_df["Average Fare per Driver"] = pyber_type_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

#pyber_type_summery_df.index.name = None
pyber_type_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,1625,2405,"$39,854.38",$24.53,$16.57

In [1415]:
new_data_fare = pyber_data_complete_df.set_index(["Date"])["Fare"]
new_data_fare

Date
2019-01-14 10:14:22    13.83
2019-03-04 18:24:09    30.24
2019-02-24 04:29:00    33.44
2019-02-10 23:22:03    23.44
2019-03-06 04:28:35    34.58
                       ...
2019-04-29 17:04:39    13.38
2019-01-30 00:05:47    20.76
2019-02-10 21:03:50    11.11
2019-05-07 19:22:15    44.94
2019-04-25 10:20:13    55.84
Name: Fare, Length: 2375, dtype: float64

In [1425]:
new_data = pyber_data_complete_df.set_index(["Date"])["City Type"]
new_data

Date
2019-01-14 10:14:22    Urban
2019-03-04 18:24:09    Urban
2019-02-24 04:29:00    Urban
2019-02-10 23:22:03    Urban
2019-03-06 04:28:35    Urban
                       ...
2019-04-29 17:04:39    Rural
2019-01-30 00:05:47    Rural
2019-02-10 21:03:50    Rural
2019-05-07 19:22:15    Rural
2019-04-25 10:20:13    Rural
Name: City Type, Length: 2375, dtype: object

In [1472]:
new_data_date_summary_df = pd.DataFrame({
        "City Type":new_data,
        "Fare": new_data_fare})
new_data_date_summary_df

                    City Type   Fare
Date
2019-01-14 10:14:22     Urban  13.83
2019-03-04 18:24:09     Urban  30.24
2019-02-24 04:29:00     Urban  33.44
2019-02-10 23:22:03     Urban  23.44
2019-03-06 04:28:35     Urban  34.58
...                       ...    ...
2019-04-29 17:04:39     Rural  13.38
2019-01-30 00:05:47     Rural  20.76
2019-02-10 21:03:50     Rural  11.11
2019-05-07 19:22:15     Rural  44.94
2019-04-25 10:20:13     Rural  55.84

[2375 rows x 2 columns]

In [1483]:
new_data_date_summary_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2375 entries, 2019-01-14 10:14:22 to 2019-04-25 10:20:13
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   City Type  2375 non-null   object
 1   Fare       2375 non-null   float64
dtypes: float64(1), object(1)
memory usage: 135.7+ KB

In [1474]:
new_city_date = pyber_data_complete_df.set_index(["City Type"])["Date"]
new_city_date

City Type
Urban    2019-01-14 10:14:22
Urban    2019-03-04 18:24:09
Urban    2019-02-24 04:29:00
Urban    2019-02-10 23:22:03
Urban    2019-03-06 04:28:35
                ...
Rural    2019-04-29 17:04:39
Rural    2019-01-30 00:05:47
Rural    2019-02-10 21:03:50
Rural    2019-05-07 19:22:15
Rural    2019-04-25 10:20:13
Name: Date, Length: 2375, dtype: object

In [1486]:
new_date_summary_df = pd.DataFrame({
        "Date":new_city_date})
new_date_summary_df

                          Date
City Type
Urban      2019-01-14 10:14:22
Urban      2019-03-04 18:24:09
Urban      2019-02-24 04:29:00
Urban      2019-02-10 23:22:03
Urban      2019-03-06 04:28:35
...                        ...
Rural      2019-04-29 17:04:39
Rural      2019-01-30 00:05:47
Rural      2019-02-10 21:03:50
Rural      2019-05-07 19:22:15
Rural      2019-04-25 10:20:13

[2375 rows x 1 columns]

In [1475]:
fares_by_date = pyber_data_complete_df.groupby(["Date","City Type"]).sum()["Fare"]

fares_by_date

Date                 City Type
2019-01-01 00:08:16  Urban        37.91
2019-01-01 00:46:46  Suburban     47.74
2019-01-01 02:07:24  Suburban     24.07
2019-01-01 03:46:50  Urban         7.57
2019-01-01 05:23:21  Urban        10.75
                                  ...
2019-05-08 04:20:00  Urban        21.99
2019-05-08 04:39:49  Urban        18.45
2019-05-08 07:29:01  Urban        18.55
2019-05-08 11:38:35  Urban        19.77
2019-05-08 13:10:18  Urban        18.04
Name: Fare, Length: 2375, dtype: float64

In [1489]:
fares_by_date = pyber_data_complete_df.groupby(["Date"]).sum()["Fare"]

fares_by_date

Date
2019-01-01 00:08:16    37.91
2019-01-01 00:46:46    47.74
2019-01-01 02:07:24    24.07
2019-01-01 03:46:50     7.57
2019-01-01 05:23:21    10.75
                       ...
2019-05-08 04:20:00    21.99
2019-05-08 04:39:49    18.45
2019-05-08 07:29:01    18.55
2019-05-08 11:38:35    19.77
2019-05-08 13:10:18    18.04
Name: Fare, Length: 2375, dtype: float64

In [1490]:
sum_fare_by_type = new_data_date_summary_df, new_date_summary_df

In [1491]:
sum_fare_by_type.pivot = sum_fare_by_type.pivot(index="Date", columns="City Type")["Fare"]

AttributeError: 'tuple' object has no attribute 'pivot'

In [ ]:
# Add Matplotlib inline magic command
#%matplotlib inline
# Dependencies and Setup
# Adding a list of values with keys to create a new DataFrame.
pyber_new_data_summary_df = pd.DataFrame({
        #"Total Rides": per_type_total_rides,
        #"Total Drivers": per_type_total_drivers,
        "Total Fares": new_pyber_data})
        #"Average Fare per Ride": per_type_average})
        #"Average Fare per Driver": per_type_avg_driver})
lines = df.plot.line()

pyber_new_data_summary_df